Catalogs/НазначенияИспользования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>НазначенияИспользования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СрокПолезногоИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияРасходовПоАмортизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМалоценки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМалоценки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетПередачиБУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетАмортизацииБУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬНалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетБУДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыМалоценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыМалоценки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МалоценныйБыстроизнашивающийсяПредмет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МалоценныйНеоборотныйАктив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БиблиотечныеФонды</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/НазначенияИспользования/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура проверяет правильно ли выбан счет передачи БУ.
// В случае неправильного заполнения меняет на значение
// по умолчанию.
Процедура ПроверитьПравильностьЗаполненияСчетаПередачиБУ(Сообщать, Заголовок = "") Экспорт
	
	Если ВидМалоценки = Перечисления.ВидыМалоценки.МалоценныйБыстроизнашивающийсяПредмет Тогда
		
		// МБП
		СчетПередачиБУ = ПланыСчетов.Хозрасчетный.Вспомогательный;
		Возврат;	
		
	КонецЕсли;
	
	// Определение счетов для проверки
	СчетМалоценныхНА            = ПланыСчетов.Хозрасчетный.МалоценныеНеоборотныеМатериальныеАктивы;
	СчетМалоценныхНАПоУмолчанию = ПланыСчетов.Хозрасчетный.МалоценныеНеоборотныеМатериальныеАктивыКоличественно;
	
	СчетБиблиотечныхФондов            = ПланыСчетов.Хозрасчетный.БиблиотечныеФонды;
	СчетБиблиотечныхФондовПоУмолчанию = ПланыСчетов.Хозрасчетный.БиблиотечныеФондыКоличественно;
	
	Если Сообщать Тогда
		
		ЗаготовкаСообщения1 = Локализация.СтрШаблон1("	Исходя из вида малоценки: ""¤1¤"""
"	""Счет передачи"" должен быть субсчетом счета """, ВидМалоценки);
		ЗаготовкаСообщения2 = Локализация.СтрШаблон1(""
"	Счет был изменен с ""¤1¤"" на """, СчетПередачиБУ);
		
	КонецЕсли;
	
	БылаЗамена = Ложь;
	
	Если ВидМалоценки = Перечисления.ВидыМалоценки.МалоценныйНеоборотныйАктив Тогда
		// Малоценные необоротные активы
		
		Если НЕ ЗначениеЗаполнено(СчетПередачиБУ) ИЛИ (НЕ СчетПередачиБУ.ПринадлежитЭлементу(СчетМалоценныхНА)) Тогда
			
			Если Сообщать Тогда
				
				Сообщение = ЗаготовкаСообщения1 + СчетМалоценныхНА + """."
				            + ЗаготовкаСообщения2 + СчетМалоценныхНАПоУмолчанию + """.";
								 
			КонецЕсли;
			
			СчетПередачиБУ = СчетМалоценныхНАПоУмолчанию;
			БылаЗамена     = Истина;
			
		КонецЕсли;
		
	ИначеЕсли ВидМалоценки = Перечисления.ВидыМалоценки.БиблиотечныеФонды Тогда
		// Библиотечные фонды
	   
		Если НЕ ЗначениеЗаполнено(СчетПередачиБУ) ИЛИ (НЕ СчетПередачиБУ.ПринадлежитЭлементу(СчетБиблиотечныхФондов)) Тогда
			
			Если Сообщать Тогда
				
				Сообщение = ЗаготовкаСообщения1 + СчетБиблиотечныхФондов + """."
				            + ЗаготовкаСообщения2 + СчетБиблиотечныхФондовПоУмолчанию + """.";
								 
			КонецЕсли;
			
			СчетПередачиБУ = СчетБиблиотечныхФондовПоУмолчанию;
			БылаЗамена     = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Сообщать И БылаЗамена Тогда
	
		ОбщегоНазначения.СообщитьИнформацию(Сообщение, Заголовок, СтатусСообщения.Важное); 
		
	КонецЕсли; 

КонецПроцедуры // ПроверитьПравильностьЗаполненияСчетаПередачиБУ()

// Процедура проверяет правильно ли выбан счет амортизации БУ.
// В случае неправильного заполнения меняет на значение
// по умолчанию.
Процедура ПроверитьПравильностьЗаполненияСчетаАмортизацииБУ(Сообщать, Заголовок = "") Экспорт
	
	// Определение счетов для проверки
	СчетАмортизацииНА                      = ПланыСчетов.Хозрасчетный.ИзносДругихНеоборотныхМатериальныхАктивов;
	СчетАмортизацииМалоценныхНАПоУмолчанию = ПланыСчетов.Хозрасчетный.ИзносДругихНеоборотныхМатериальныхАктивовКоличественно;
	
	Если Сообщать Тогда
		
		ЗаготовкаСообщения1 = Локализация.СтрШаблон1("	Исходя из вида малоценки: ""¤1¤""	""Счет амортизации"" должен быть субсчетом счета ""¤2¤"".", ВидМалоценки, СчетАмортизацииНА);
		ЗаготовкаСообщения2 = Локализация.СтрШаблон1("	Счет был изменен с ""¤1¤"" на """, СчетАмортизацииБУ);
		
	КонецЕсли;
	
	БылаЗамена = Ложь;
	
	Если ВидМалоценки = Перечисления.ВидыМалоценки.МалоценныйБыстроизнашивающийсяПредмет Тогда
	    // МБП
		
		// Для МБП счет амортизации должен быть равным счету передачи
		СчетАмортизацииБУ = СчетПередачиБУ;
		
	Иначе
		// Малоценные необоротные активы и Библиотечные фонды
		
		Если НЕ ЗначениеЗаполнено(СчетАмортизацииБУ) ИЛИ (НЕ СчетАмортизацииБУ.ПринадлежитЭлементу(СчетАмортизацииНА)) Тогда
			
			Если Сообщать Тогда
				
				Сообщение = ЗаготовкаСообщения1 + ЗаготовкаСообщения2
				            + СчетАмортизацииМалоценныхНАПоУмолчанию + """.";
								 
			КонецЕсли;
			
			СчетАмортизацииБУ = СчетАмортизацииМалоценныхНАПоУмолчанию;
			БылаЗамена        = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Сообщать И БылаЗамена Тогда
		
		ОбщегоНазначения.СообщитьИнформацию(Сообщение, Заголовок, СтатусСообщения.Важное); 
		
	КонецЕсли; 

КонецПроцедуры // ПроверитьПравильностьЗаполненияСчетаАмортизацииБУ()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура проверяет, существуют ли движения в регистрах по данному
// элементу справочника. Если существуют и изменялись определенные реквизиты,
// то запрещает запись.
Процедура ПроверитьВозможностьЗаписиЭлемента(Отказ, Заголовок)

	Если ЭтоНовый() Тогда
		
		// Проверять нечего
		Возврат
		
	КонецЕсли;
	
	// По умолчанию считается, что движений не было
	БылиДвиженияБух = Ложь;
	
	// Получение старых значений
	ВладелецСтарый                = Ссылка.Владелец;
	ВидМалоценкиСтарый            = Ссылка.ВидМалоценки;
	СпособОтраженияРасходовСтарый = Ссылка.СпособОтраженияРасходов;
	СчетПередачиБУСтарый          = Ссылка.СчетПередачиБУ;
	СчетАмортизацииБУСтарый       = Ссылка.СчетАмортизацииБУ;
	
	// Проверка изменений
	ИзмененВладелец                = (Владелец <> ВладелецСтарый);
	ИзмененВидМалоценки            = (ВидМалоценки <>  ВидМалоценкиСтарый);
	ИзмененСпособОтраженияРасходов = (СпособОтраженияРасходов <> СпособОтраженияРасходовСтарый);
	ИзмененСчетПередачиБУ          = (СчетПередачиБУ <> СчетПередачиБУСтарый);
	ИзмененСчетАмортизацииБУ       = (СчетАмортизацииБУ <> СчетАмортизацииБУСтарый);
	
	Если ИзмененВладелец  
	 ИЛИ ИзмененСпособОтраженияРасходов
	 ИЛИ ИзмененВидМалоценки
	 ИЛИ ИзмененСчетПередачиБУ ИЛИ ИзмененСчетАмортизацииБУ Тогда
		// Нужно проверить движения по бухгалтерскому учету
		
		БылиДвиженияБух = ПолныеПрава.НазначенияИспользования_БылиДвиженияПоРегистру(Ссылка);
		
	КонецЕсли;
	
	Если ИзмененВладелец 
	   И БылиДвиженияБух Тогда
	   
		Сообщение = Локализация.СтрШаблон1("	Нельзя изменять ""Номенклатуру"",  потому что были движения с участием данного элемента справочника."
"	Текущее значение <¤1¤> изменяется на старое <¤2¤>.", Владелец, ВладелецСтарый);
		ОбщегоНазначения.СообщитьОбОшибке(Сообщение, Отказ, Заголовок);
		Владелец  = ВладелецСтарый;
		
	КонецЕсли;
	
	Если ИзмененВидМалоценки 
	   И БылиДвиженияБух Тогда
	   
		Сообщение = Локализация.СтрШаблон1("	Нельзя изменять ""Вид малоценки"", потому что были движения с участием данного элемента справочника."
"	Текущее значение <¤1¤> изменяется на старое <¤2¤>.", ВидМалоценки, ВидМалоценкиСтарый);
		ОбщегоНазначения.СообщитьОбОшибке(Сообщение, Отказ, Заголовок);
		ВидМалоценки = ВидМалоценкиСтарый;
		
	КонецЕсли;
	
	Если ИзмененСпособОтраженияРасходов 
	   И БылиДвиженияБух Тогда
	   
		Сообщение = Локализация.СтрШаблон1("	Нельзя изменять ""Способ отражения расходов"", потому что были движения с участием данного элемента справочника."
"	Текущее значение <¤1¤> изменяется на старое <¤2¤>.", СпособОтраженияРасходов, СпособОтраженияРасходовСтарый);
		ОбщегоНазначения.СообщитьОбОшибке(Сообщение, Отказ, Заголовок);
		СпособОтраженияРасходов = СпособОтраженияРасходовСтарый;
		
	КонецЕсли;
	
	Если ИзмененСчетПередачиБУ 
	   И БылиДвиженияБух Тогда
	   
		Сообщение = Локализация.СтрШаблон1("	Нельзя изменять ""Счет передачи"", потому что были движения с участием данного элемента справочника."
"	Текущее значение <¤1¤> изменяется на старое <¤2¤>.", СчетПередачиБУ, СчетПередачиБУСтарый);
		ОбщегоНазначения.СообщитьОбОшибке(Сообщение, Отказ, Заголовок);
		СчетПередачиБУ = СчетПередачиБУСтарый;
		
	КонецЕсли;
	
	Если ИзмененСчетАмортизацииБУ 
	   И БылиДвиженияБух Тогда
	   
	   Если ВидМалоценки <> Перечисления.ВидыМалоценки.МалоценныйБыстроизнашивающийсяПредмет Тогда
		   // Если это МБП, то счет амортизации невидим, а значит не нужно сообщать
		   
		   Сообщение = Локализация.СтрШаблон1("	Нельзя изменять ""Счет амортизации"", потому что были движения с участием данного элемента справочника."
"	Текущее значение <¤1¤> изменяется на старое <¤2¤>.", СчетАмортизацииБУ, СчетАмортизацииБУСтарый);
		   ОбщегоНазначения.СообщитьОбОшибке(Сообщение, Отказ, Заголовок);
			
		КонецЕсли;
		СчетАмортизацииБУ = СчетАмортизацииБУСтарый;
		
	КонецЕсли;

КонецПроцедуры // ПроверитьВозможностьЗаписиЭлемента()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		
		// Проверять нечего
		Возврат
		
	КонецЕсли;
	
	Заголовок = Локализация.СтрШаблон1("Запись элемента справочника ""¤1¤"" Наим: <¤2¤> код: <¤3¤>, подчиненного <¤4¤>:", Метаданные().Представление(), Наименование, Код, Владелец);
	
	ПроверитьПравильностьЗаполненияСчетаПередачиБУ(Истина, Заголовок);
    ПроверитьПравильностьЗаполненияСчетаАмортизацииБУ(Истина, Заголовок);
	ПроверитьВозможностьЗаписиЭлемента(Отказ, Заголовок);
	
	СчетБУДляПечати = "";
	
	Если ВидМалоценки = Перечисления.ВидыМалоценки.МалоценныйБыстроизнашивающийсяПредмет Тогда
		
		МассивСчетовЗатрат = СпособОтраженияРасходов.Способы.ВыгрузитьКолонку("СчетЗатрат");
		Разделитель = "";
		
		Для каждого СчетЗатрат Из МассивСчетовЗатрат Цикл
		
			СчетБУДляПечати = СчетБУДляПечати + Разделитель + СчетЗатрат;
			Разделитель = ", ";
		
		КонецЦикла;
		
	Иначе
		
		СчетБУДляПечати = СчетПередачиБУ;
		
	КонецЕсли;
	
КонецПроцедуры
